{
	"m_title":"Überschwemmungsschutz",
	"m_descr":"Diese App überwacht alle Wasserstandsmelder, die in ihrem Z-Way inkludiert sind. <br><br>Verfügbare Funktionen: <ul><li>hinzufügen von Wasserstandsmeldern, die überwacht werden sollen</li><li>Aktion festlegen, die stattfinden soll, wenn Alarm ausgelöst wird - Aktion mit Schalter, Dimmer, Motorsteuerung oder Szenen</li><li>App Instanz erzeugt ein Gerät(Widget) in der Elementübersicht, dass den Alarm scharf schalten oder entschärfen kann </li><li>zeigt die Levelstati 'OK', 'OK!' - wenn der Alarm ausgelöst wurde aber das Widget nachwievor scharf geschalten ist - und 'ALERT' wenn mindestens einer der Sensoren anschlägt</li><li>wenn das Widget entschärft wird, wird ein Basic 'off' an alle inkludierten Sensoren gesendet </li><li>nach dem Entschärfen wird ein Intervall gestartet, der regelmäßig die Sensorenstati checkt und das Widgetlevel wieder auf 'OK' setzt, wenn keiner der Sensoren mehr Alarm schlägt</li><li>einen 'Out Of Band' Service auswählen (Eine App die ein geeignetes virtuelles Gerät zur Verfügung stellt ist dazu notwendig - z.B. 'E-Mail Benachrichtigungen'.)</li></ul>",
	"l_dev":"Wasserstandsmelder hinzufügen:",
	"l_action":"Führe folgende Aktionen aus, wenn der Alarm ausgelöst wird:",
	"l_choose_dev":"--- Gerät wählen ---",
	"on":"An",
	"off":"Aus",
	"level":"Level",
	"l_filter":"Filtern nach Typ",
	"l_choose_type":"--- Gerätetyp wählen ---",
	"switchBinary":"Binärschalter",
	"switchMultilevel":"Multilevelschalter",
	"scene":"Szene",
	"h_statusOn":"Es wird nur 'An' als Befehl gesendet.",
	"l_notification":"Benachrichtigung",
	"l_notifier":"Benachrichtigungsauslöser auswählen",
	"l_message":"Nachricht:",
	"one_min":"1 Minute",
	"two_min":"2 Minuten",
	"five_min":"5 Minuten",
	"ten_min":"10 Minuten",
	"fifteen_min":"15 Minuten",
	"half_h":"eine halbe Stunde",
	"one_h":"1 Stunde",
	"l_interval":"Wenn der Alarm ausgelöst wurde, sende eine Nachricht aller:",
	"abort_sending_msg":"Benachrichtigung wird eingestellt. Die Sensoren senden keinen Alarm mehr. Der Überschwemmungsschutz ist weiterhin aktiv ...",
	"disarmed":"Benachrichtigung wird eingestellt. Der Überschwemmungsschutz wurde deaktiviert ..."
}