[
    {
        "id": "1",
        "date": "2015-09-18",
        "manufacturer": "Phillio",
        "product": "PHI_PST02-1A",
        "firmware": "V2",
        "problem_en": "The device works fine when included non secure. When included secure certain interview commands are not answered correctly and the device used unsecure communication within secure environments. This is a violation of the Z-Wave security policy and protocol.",
        "problem_de": "Das Gerät funktioniert wenn es \"non secure\" eingebunden wird fehlerfrei. Wenn es jedoch \"secure\" eingebunden wird dann werden bestimmte Kommandos nicht korrekt beantwortet und das interview kann nicht vollständig beendet werden. Dabei handelt es sich gegen einen Verstoß gegen das Z-Wave Sicherheitskonzept.",
        "device_id": "316.2.12",
        "solution": "unsecure",
        "workaround": "It is possible to force an non secure inclusion using the Expert UI."
    },
    {
        "id": "2",
        "date": "2001-01-20",
        "manufacturer": "Everspring",
        "product": "EVR_STS814",
        "firmware": "",
        "problem_en": "The device reports both temperature and humidity values. When asked right after each other the device mixes up the values and may report the humidity value a temperature value and vice versa. the technical reason is a bug in the send queue of the device.",
        "problem_de": "Das Gerät meldet sowohl Temperatur- und Feuchtewerte. Werden beide direkt nacheinander abgerufen vermischen sich die Werte und werden falsch dargestellt. Der Technische Grund ist ein Fehler in der Sendewarteschlange des Gerätes.",
        "device_id": "96.6.1",
        "solution": "",
        "workaround": "You may want to rewrite the sensor polling app and filter for all ST814 devices and make sure that only one value is requested per wakeup interval. The original Sensor Polling app does not have this workaround and there are no plans to inflate the code of this module to workaround the problems of this device."
    }
]