{
  "C": "Komfort",
  "E": "Energiespar",
  "F": "Frostschutz",
  "etimes": "Endzeit",
  "friday_short": "Fr",
  "h_resetTime": "in Stunden",
  "l_table": "Raumeinstellungen",
  "l_temperature_id": "Temperatur",
  "l_times_id": "Zeitplan",
  "m_comfort": "Komforttemp.",
  "m_descr": "Die Heizungssteuerung ermöglicht die raumindividuelle Temperierung Ihres Heims.<br/><br/><h3>Konfiguration</h3><strong>Raum Einstellungen</strong><br/><ul><li>Fügen Sie die Räume hinzu, die von der Heizungssteuerung verwaltet werden sollen.</li><li>Pro Raum können Sie optional einen Temperatursensor auswählen, der später in der Übersicht aufgelistet werden soll.</li><li>Wählen Sie eine Komfort-Temperatur, die im Bereich zwischen 14 und 27 Grad liegt.</li><li>Wählen Sie eine Energiespar-Temperatur, welche im Energiesparmodus verwendet werden soll und die im Bereich zwischen 14 und 27 Grad liegt.</li><li>Abschließend wählen Sie eine Fallback-Temperatur, die verwendet wird, wenn die Anwendung gemäß dem Zeitplan arbeitet, aber für den aktuellen Zeitpunkt kein Eintrag vorhanden ist.</li><li>Verwenden Sie die Schaltfäche <i class='glyphicon glyphicon-plus-sign'></i> und <i class='glyphicon glyphicon-minus-sign'></i> um einen weiteren Eintrag hinzuzufügen bzw. einen bestehenden Eintrag zu löschen.</li></ul><strong>Zeitplan Einstellungen</strong><br/><ul><li>Wählen Sie einen der zuvor definierten Räume und selektieren Sie die Wochentage und die Zeitstpanne, die durch den Zeitplan abgedeckt werden soll.</li><li>Anschließend wählen Sie die gewünschte Temperatur, indem Sie einen Wert zwischen 14 und 27 Grad oder einen der Modi Frostschutz, Energiesparen oder Komfort wählen.</li><li>Verwenden Sie die Schaltfäche <i class='glyphicon glyphicon-plus-sign'></i> und <i class='glyphicon glyphicon-minus-sign'></i> um einen weiteren Eintrag hinzuzufügen bzw. einen bestehenden Eintrag zu löschen.</li><li>Über die Schaltfäche <i class='fa fa-clone'></i> haben Sie die Möglichkeit den aktuellen Eintrag zu duplizieren.</li><li><strong>Beachten Sie, dass eine fehlerhafte Konfiguration zu undefiniertem Verhalten führen kann.</strong></li></ul><strong>Erweiterte Einstellungen</strong><br/><ul><li>Setzen Sie weiterhin die automatische Rücksetzzeit, indem Sie einen ganzzahligen Stundenwert X eingeben. Werden im laufenden Betrieb Änderungen an einzelnen Thermostaten vorgenommen, so werden diese nach X Stunden automatisch rückgängig gemacht, so dass das System wieder konform mit der Steuerung durch diese Anwendung arbeitet.</li></ul><h3>Handhabung</h3>Die Anwendung generiert nach erfolgreicher Konfiguration ein eigenständiges Widget, welches die Steuerung der Heizungsmodi über vier Schaltfächen ermöglicht.<br/><img src='/ZAutomation/api/v1/load/modulemedia/ClimateControl/widget_de.png' style='display:block; margin: 0 auto;'></img><br/>Von links nach rechts haben die Schaltfächen die Funktionen Frostschutz|Energiesparen|Komfort|Zeitgesteuert.<br/>Über die Schaltfäche 'Räume' können Sie das Konfigurationsfenster mit der Auflistung der einzelnen Räume öffnen.<br/><img src='/ZAutomation/api/v1/load/modulemedia/ClimateControl/modal_de.png' style='display:block; margin: 0 auto;'></img><br/>Wenn für den Raum ein Temperatursensor festgelegt wurde, liefert Ihnen die Übersicht den aktuellen Temperaturwert. Weiterhin wird der aktuell eingestellte Temperaturwert gelistet. Über das Dropdown-Menü haben Sie die Möglichkeit einen der vier Modi pro Raum zu setzen. Das folgende Icon zeigt Ihnen, dass die benutzerspezifische Einstellung pro Raum aktiv ist:<br/><img src='/ZAutomation/api/v1/load/modulemedia/ClimateControl/widget_custom_de.png' style='display:block; margin: 0 auto;'></img>",
  "m_energySave": "Energiespar-Temp.",
  "m_fallback": "Fallback Temp.",
  "m_mainSens": "Sensor",
  "m_resetTime": "Automatisierte Rücksetzzeit",
  "m_rooms": "Räume",
  "m_setup": "Raumeinstellungen",
  "m_title": "Heizungssteuerung",
  "monday_short": "Mo",
  "saturday_short": "Sa",
  "select_room": "--- Raum auswählen ---",
  "stimes": "Startzeit",
  "sunday_short": "So",
  "thursday_short": "Do",
  "tuesday_short": "Di",
  "wednesday_short": "Mi",
  "err_wrong_time_format": "Falsches Zeitformat",
  "err_something_went_wrong": "Interner Fehler",
  "err_wrong_date_format": "Falsches Datumsformat",
  "err_no_thermostats": "Keine Thermostate in Raum ",
  "err_parsing_schedule_data": "Interner Fehler während dem einlesen des Zeitplans",
  "err_temp_out_of_range": "Temperatur außerhalb des gültigen Bereichs",
  "err_temp_entry": "Fehlerhafter Temperatureintrag"
}