{
	"m_title":"Security Mode",
	"m_descr":"This complex application will realize a complete House Alarm system using existing Z-Wave already installed in your home. You define they way to arm and to disarm the alarm and what devices will trigger an alarm condition. The app will create a new element that shows the alarm status and allows to arm and to disarm the alarm system as well. Furthermore the app allows defining the actions to be done and the alerts to be sent out on case of an alarm.<br><br>Settings:<br><ul><li>Pick all devices that shall arm and disarm the event. On default the element on the UI will do this all the time. That’s why it is ok not to define any further devices fort he arm/disarm control. In case you want to have a remote control or any other mobile device to arm/disarm the alarm you will need to install the app „Trap events from remotes“ first. You can also define any actor or sensor to arm and disarm the system. Examples for this are „As soon as the TV is turned off arm the alarm“ or „as soon as the light in bathroom turns on, disarm the alarm“. However you should note that a direct control of a publicly accessible device like the bathroom light switch my compromise your security system. A particularly smart idea is to disarm the alarm in case of a successful use of a user code on the main door lock.</li><li>Pick the devices that shall trip the alarm. These are usually door/window sensors, window handles, glass breaking sensors but can also be e.g. the light switch in the main lobby</li><li>Define the action to be done in case of a tripping alarm (when armed). This can be turning on a light switch or using one of the out-of-Band notifiers like SMS. With every action you can setup a delay time This allows you to escalate actions</li></ul><br>Usage: The Security App will create one new element in the UI showing status of the Alarm and offering to arm/disarm the system. Sends a notification of type 'Warning' if one sensor of all triggered.",
	"action_msg":"Alert!",
	"l_tests":"Sensors:",
	"l_test_binary":"Binary condition",
	"l_test_multi":"Multilevel condition",
	"l_tests_remote":"Remote condition",
	"l_timeout":"Idle time in seconds after last sensor trigger",
	"h_timeout":"If any of the sensors triggered during this period, no additional message will be sent to reduce spam",
	"l_action":"Actions",
	"l_message":"Text message",
	"l_phone":"Phone number to send SMS. In form of 79261234567",
	"l_api_key_sms":"API key from http://sms.ru",
	"h_api_key_sms":"After registration on the right you will see api_id (looks like: a43f6376-f57d-27e4-5981-ec48945d871f)",
	"l_email":"Email that will be notified",
	"l_api_key_email":"API key from https://mandrillapp.com",
	"h_api_key_email":"After registration email on the tab Setting create a key (looks like: VFfeEspkFL1YqVSihhfqHw)",
	"l_switches":"List of switches:",
	"on":"On",
	"off":"Off",
	"l_dimmers":"List of dimmers:",
	"l_status":"Level",
	"l_locks":"List of locks:",
	"open":"Open",
	"close":"Close",
	"l_scenes":"List of scenes to activate:"
}