{	
	"ac_warn_restart":"El controlador de automatización se ha reiniciado.",
	"ac_err_init_module_not_found":"No se ha podido instanciar el módulo: módulo no encontrado en la lista de todos los módulos.",
	"ac_err_init_module":"No se ha podido instanciar el módulo: ",
	"ac_err_dep_not_found":"Dependencia no encontrada para el módulo: [DEP]::[MODUL] = ",
	"ac_err_dep_not_loaded":"No se ha podido cargar el módulo porque la dependencia no se ha cargado: [DEP]::[MODUL] = ",
	"ac_err_dep_not_init":"No se ha podido cargar el módulo porque la dependencia no se ha instanciado: [DEP]::[MODUL] = ",
	"ac_err_file_load":"No se ha podido cargar ",
	"ac_err_invalid_module":"Módulo no válido ",
	"ac_err_load_mod_json":"No se han podido cargar los módulos .json desde ",
	"ac_err_stop_mod":"No se ha podido detener el módulo ",
	"ac_err_uninstall_mod":"No se ha podido desinstalar ni reiniciar la aplicación.",
	"ac_err_uninstall_skin":"No se ha podido desinstalar el tapiz.",
	"ac_err_uninstall_icon":"No se ha podido desinstalar el icono.",
	"ac_err_instance_already_exists":"No se pueden registrar instancias de módulo duplicadas: ",
	"ac_err_instance_empty":"No se pueden registrar instancias de módulo vacías: ",
	"ac_err_create_instance":"No se ha podido crear la instancia. [APP] :: [INSTANCE ID] = ",
	"ac_err_refonfigure_instance":"No se ha podido reconfigurar la instancia con el id.: ",
	"ac_err_location_not_found":"La ubicación no existe.",
	"ac_err_load_failure":"Se ha producido un fallo mientras la aplicación se instanciaba. Vuelva a cargar o a instalar la aplicación",
	"profile_name": "Administrador",
	"profile_descr": "Este es el perfil del administrador. Perfil del administrador creado automáticamente.", 
	"vd_err_virtual_dev":"Error durante la ejecución del comando: ",
	"no_devices_found":"No se ha encontrado ningún dispositivo",
	"err_preparing_room_dev_structure":"No se ha podido preparar la relación Habitación-Dispositivo.",
	"err_parsing_npc_filters":"No se han podido analizar los filtros a partir de los espacios nominales.",
	"zaap_err_uninstall_mod":"No se ha podido desinstalar la aplicación.",
	"zaap_err_unload_mod":"No se ha podido descargar la aplicación.",
	"zaap_war_restart_necessary":"La aplicación se ha descargado correctamente pero la inicialización no se ha podido llevar a cabo. Reinicie el servidor para concluir la inicialización.",
	"zaap_err_app_install":"Se ha producido un error durante la instalación de la aplicación. La instalación se ha cancelado.",
	"zaap_war_app_installed_corrupt_instance":"No se ha encontrado ninguna aplicación con esta versión en el archivo disponible. En su lugar se ha instalado la versión más reciente. Puede que las instancias de esta aplicación existentes ya no funcionen. Elimínelas de Apps > Active y añada las nuevas a Apps > Local.",
	"zaap_war_core_app_is_newer":"Esta aplicación ya está instalada con la misma versión o una más reciente. La instalación se ha cancelado. Puede que las instancias existentes de esta aplicación ya no funcionen. Elimínelas de Apps > Active y añada las nuevas a Apps > Local.",
	"zaap_err_no_archives":"Esta aplicación no tiene archivo. La instalación se ha cancelado.",
	"zaap_err_server":"No se ha podido acceder al servidor de descarga o este responde con un error. Inténtelo de nuevo más tarde.",
	"zaap_err_reboot":"Su plataforma no admite el comando de reinicio, desconecte la alimentación o siga las indicaciones del manual del controlador."
}