{
	"m_title":"ZMatter Network Access",
	"m_descr":"Z-Way controls one ZMatter network with up to 232 devices. This app will combine multiple Z-Way entities into one User Interface. Essentially the app is mapping the data of another Z-Way powered Gateway into your gateway. The elements are displayed and can be used like the local ones. Please note that the function of the second gateway remains untouched. This means that this second gateway will not see the elements for your first gateway but can control and access their own elements without and further restrictions: <br><br> Settings: <br><ul><li>You need to set the IP address of the Remote Box including the port number. </li><li>You need to define the polling interval. Once second in a quite good choice.</li> <li>You need to manage the remove device to be included into you UI.</li></ul>",
	"l_port":"Serial port to ZMatter dongle",
	"h_port":"Example: SR:/dev/ttyUSB1 or SR:/dev/serial/by-id/usb-Silicon_Labs_CP2105_Dual_USB_to_UART_Bridge_Controller_012082E1-if01-port0",
	"l_name":"Internal name",
	"h_name":"Should be a valid JS key string. Don't change unless you know what you are doing",
	"l_wifiEssid": "Wi-Fi network name",
	"h_wifiEssid": "Used to commission Matter over Wi-Fi devices",
	"l_wifiPassword": "Wi-Fi password",
	"h_wifiPassword": "Used to commission Matter over Wi-Fi devices",
	"l_threadCredential": "Thread credentials",
	"h_threadCredential": "Used to commission Matter over Thread devices. Find it in settings of your existing Thread Border Gateway",
	"rl_enableAPI":"Enable ZMatter API",
	"h_enableAPI":"Handler HTTP requests to /ZMatterAPI/* and /ZMatter/&lt;internal zway name&gt;/*",
	"rl_publicAPI":"Allow public access to ZMatter API",
	"h_publicAPI":"Do not ask for authentication to access ZMatter API",
	"rl_createVDev":"Create virtual devices in Home Automation engine",
	"h_createVDev":"Without this ZMatter devices will be visible only in Expert UI and via ZMatter API",
	"l_config":"Path to config folder",
	"l_paa_folder":"Path to PAA folder",
	"l_cd_folder":"Path to CD folder",
	"err_binding_start":"Cannot start ZMatter binding: ",
	"err_connct":"Connection lost to ZMatter device ID: ",
	"err_reset": "User reset to factory defaults ZMatter device ID: ",
	"dev_btl":"ZMatter device ID is back to life: ",
	"err_dev_create":"Cannot create vDev based on: ",
	"main":"main powered devices",
	"battery":"battery powered devices"
}